lixpaulian/efr32xx-rail/platform/middleware/usb_gecko/inc/em_usb.h
SL_PACK_END()


/** @brief USB Endpoint Descriptor. */
SL_PACK_START(1)
typedef struct
{
  uint8_t   bLength;                            /**< Size of this descriptor in bytes                  */
  uint8_t   bDescriptorType;                    /**< Constant ENDPOINT Descriptor Type                 */
  uint8_t   bEndpointAddress;                   /**< The address of the endpoint                       */
  uint8_t   bmAttributes;                       /**< This field describes the endpoint attributes      */
  uint16_t  wMaxPacketSize;                     /**< Maximum packet size for the endpoint              */
  uint8_t   bInterval;                          /**< Interval for polling EP for data transfers        */
} SL_ATTRIBUTE_PACKED USB_EndpointDescriptor_TypeDef;
SL_PACK_END()


/** @brief USB String Descriptor. */
SL_PACK_START(1)
typedef struct
{
  uint8_t len;                                  /**< Size of this descriptor in bytes.                 */
  uint8_t type;                                 /**< Constant STRING Descriptor Type.                  */
  char16_t name[];                              /**< The string encoded with UTF-16LE UNICODE charset. */
} SL_ATTRIBUTE_PACKED USB_StringDescriptor_TypeDef;
SL_PACK_END()

/** @} (end addtogroup USB_COMMON) */

/*** -------------------- Serial port debug configuration ---------------- ***/

#if defined(DOXY_DOC_ONLY)
/** @addtogroup USB_COMMON
 *  @{*/

/***************************************************************************//**
 * @brief
 *   Transmit a single char on the debug serial port.
 *
 * @note
 *   This function is enabled with \#define DEBUG_USB_API when configuring the
 *   protocol stack in "usbconfig.h".
 *   This is convenient when debugging code, no need to remove use of this
 *   function when debugging has completed.
 *
 * @param[in] c
 *   Char to transmit.
 *
 * @return
 *   The char transmitted.
 ******************************************************************************/
int USB_PUTCHAR(char c);

/***************************************************************************//**
 * @brief
 *   Transmit a zero terminated string on the debug serial port.
 *
 * @note
 *   This function is enabled with \#define DEBUG_USB_API when configuring the
 *   protocol stack in "usbconfig.h".
 *   This is convenient when debugging code, no need to remove use of this
 *   function when debugging has completed.
 *
 * @param[in] p
 *   Pointer to string to transmit.
 ******************************************************************************/
void USB_PUTS(const char *p);

/***************************************************************************//**
 * @brief
 *   Transmit "printf" formated data on the debug serial port.
 *
 * @note
 *   This function is enabled with \#define USB_USE_PRINTF when configuring the
 *   protocol stack in "usbconfig.h".
 *   This is convenient when debugging code, no need to remove use of this
 *   function when debugging has completed.
 *
 * @param[in] format
 *   Format string (as in printf). No floating point format support.
 *
 * @return
 *   Number of chars transmitted.
 ******************************************************************************/
int USB_PRINTF(const char *format, ...);

/** @} (end addtogroup USB_COMMON) */
#endif /* defined(DOXY_DOC_ONLY) */

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/* Hardware constraint, do not change. */
#define MAX_NUM_HOSTCHANNELS  14

/* The DMA engine use one FIFO ram word for each host channel. */
#define MAX_HOST_FIFO_SIZE_INWORDS (512-MAX_NUM_HOSTCHANNELS)/*Unit is 4 bytes*/

#if defined (USER_PUTCHAR)
  void USB_Puts(const char *p);
  #define USB_PUTS(s)            USB_Puts(s)
  #define USB_PUTCHAR(c)         USER_PUTCHAR(c)
#else
  #define USB_PUTS(s)
  #define USB_PUTCHAR(c)
#endif

#if defined(USB_USE_PRINTF)
  #define USB_PRINTF                  printf
#else
  #define USB_PRINTF(...)
#endif /* defined(USB_USE_PRINTF) */

#if defined(DEBUG_USB_API)
  #define DEBUG_USB_API_PUTS(s)       USB_PUTS(s)
  #define DEBUG_USB_API_PUTCHAR(c)    USB_PUTCHAR(c)
#else
  #define DEBUG_USB_API_PUTS(s)
  #define DEBUG_USB_API_PUTCHAR(c)
#endif /* defined(DEBUG_USB_API) */

/** @endcond */

/*** -------------------- Common API definitions ------------------------- ***/

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

#if defined(USB_HOST)
  #if defined(NUM_APP_TIMERS)
    #define NUM_QTIMERS (NUM_HC_USED + 2 + NUM_APP_TIMERS + 1)
  #else
    #define NUM_QTIMERS (NUM_HC_USED + 2 + 1)
  #endif
  /* + 2 for default ctrl. host ch. 0 & 1, + 1 for host port timer  */
#else
  #if defined(NUM_APP_TIMERS)
    #define NUM_QTIMERS (NUM_APP_TIMERS)
  #else
    #define NUM_QTIMERS 0
  #endif
#endif /* defined(USB_HOST) */
/** @endcond */

/** @addtogroup USB_COMMON
 *  @{*/

/***************************************************************************//**
 * @brief
 *  USB transfer callback function.
 *
 * @details
 *  The callback function is called when a transfer has completed. An application
 *  should check the status, xferred and optionally the remaining parameters
 *  before deciding if the transfer is usable. In the case where the transfer
 *  is part of a control request data stage, the callback function should
 *  return an appropriate @ref USB_Status_TypeDef status.
 *
 * @param[in] status
 *   The transfer status. See @ref USB_Status_TypeDef.
 *
 * @param[in] xferred
 *   Number of bytes actually transferred.
 *
 * @param[in] remaining
 *   Number of bytes not transferred.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code.
 ******************************************************************************/
typedef int (*USB_XferCompleteCb_TypeDef)(USB_Status_TypeDef status, uint32_t xferred, uint32_t remaining);

/***************************************************************************//**
 * @brief
 *  USBTIMER callback function.
 *
 * @details
 *  The callback function is called when an USBTIMER has expired. The callback
 *  is done with interrupts disabled.
 ******************************************************************************/
typedef void (*USBTIMER_Callback_TypeDef)(void);

char *USB_GetErrorMsgString(            int error);

#if defined(USB_USE_PRINTF)
  void USB_PrintErrorMsgString(         char *pre, int error);
#else
  #define USB_PrintErrorMsgString(      pre, error)
#endif

