lixpaulian/efr32xx-rail/platform/middleware/usb_gecko/inc/em_usb.h
/** @} (end addtogroup USB_DEVICE) */
#endif /* defined(USB_DEVICE) */


#if defined(USB_HOST)
/***************************************************************************//**
 * @addtogroup USB_HOST
 * @brief USB HOST protocol stack, see @ref usb_host page for detailed documentation.
 * @{
 ******************************************************************************/
/*** -------------------- HOST mode API definitions ---------------------- ***/

#define USB_VBUSOVRCUR_PORT_NONE     -1       /**< No overcurrent flag functionality.                   */
#define USB_VBUSOVRCUR_POLARITY_LOW  0        /**< Overcurrent flag pin polarity is low.                */
#define USB_VBUSOVRCUR_POLARITY_HIGH 1        /**< Overcurrent flag pin polarity is high.               */

/** USB HOST endpoint status enumerator. */
typedef enum
{
  H_EP_IDLE             = 0,                      /**< The endpoint is idle.                            */
  H_EP_SETUP            = 1,                      /**< The endpoint is in SETUP stage.                  */
  H_EP_DATA_IN          = 2,                      /**< The endpoint is in DATA IN stage.                */
  H_EP_DATA_OUT         = 3,                      /**< The endpoint is in DATA OUT stage.               */
  H_EP_STATUS_IN        = 4,                      /**< The endpoint is in STATUS IN stage.              */
  H_EP_STATUS_OUT       = 5,                      /**< The endpoint is in STATUS OUT stage.             */
} USBH_EpState_TypeDef;


/** @brief USB HOST endpoint status data.
 *  @details A host application should not manipulate the contents of
 * this struct.                                                             */
typedef struct
{
  USB_Setup_TypeDef               setup;          /**< A SETUP package.                                 */
  uint8_t                         setupErrCnt;    /**< Error counter for SETUP transfers.               */
  USB_EndpointDescriptor_TypeDef  epDesc;         /**< Endpoint descriptor.                             */
  struct USBH_Device_TypeDef      *parentDevice;  /**< The device the endpoint belongs to.              */
  uint8_t                         type;           /**< Endpoint type.                                   */
  uint16_t                        packetSize;     /**< Packet size, current transfer.                   */
  uint8_t                         hcOut;          /**< Host channel number assigned for OUT transfers.  */
  uint8_t                         hcIn;           /**< Host channel number assigned for IN transfers.   */
  bool                            in;             /**< Endpoint direction.                              */
  uint8_t                         toggle;         /**< Endpoint data toggle.                            */
  USBH_EpState_TypeDef            state;          /**< Endpoint state.                                  */
  uint8_t                         addr;           /**< Endpoint address.                                */
  uint8_t                         *buf;           /**< Transfer buffer.                                 */
  volatile bool                   xferCompleted;  /**< Transfer completion flag.                        */
  USB_Status_TypeDef              xferStatus;     /**< Transfer status.                                 */
  USB_XferCompleteCb_TypeDef      xferCompleteCb; /**< Transfer completion callback function.           */
  uint32_t                        xferred;        /**< Number of bytes transferred.                     */
  uint32_t                        remaining;      /**< Number of bytes remaining.                       */
  uint32_t                        timeout;        /**< Transfer timeout.                                */
} USBH_Ep_TypeDef;


/** @brief USB HOST device definition.
 *  @details A host application should not manipulate the contents of
 *  this struct.                                                            */
typedef struct USBH_Device_TypeDef
{
  USB_DeviceDescriptor_TypeDef          devDesc;  /**< The device device descriptor.                    */
  USB_ConfigurationDescriptor_TypeDef   confDesc; /**< The device configuration descriptor.             */
  USB_InterfaceDescriptor_TypeDef       itfDesc;  /**< The device interface descriptor.                 */
  USBH_Ep_TypeDef                       ep0;      /**< Endpoint 0 status data.                          */
  USBH_Ep_TypeDef                       *ep;      /**< Array of endpoint status data.                   */
  int                                   numEp;    /**< Number of endpoints.                             */
  uint8_t                               addr;     /**< The device address.                              */
  uint8_t                               speed;    /**< The device speed (low or full speed).            */
} USBH_Device_TypeDef;


/** @brief USB Host stack initialization structure.
 *  @details This structure is passed to @ref USBH_Init() when starting up the
 *  device. Max accumulated FIFO size is 2K bytes.                          */
typedef struct
{
  uint32_t                  rxFifoSize;     /**< Number of FIFO bytes set aside for IN endpoints.            */
  uint32_t                  nptxFifoSize;   /**< Number of FIFO bytes set aside for OUT CTRL/BULK endoints.  */
  uint32_t                  ptxFifoSize;    /**< Number of FIFO bytes set aside for OUT INTR/ISO endoints.   */
  uint32_t                  reserved;       /**< Reserved for future use.                                    */
} USBH_Init_TypeDef;


/** Default @ref USBH_Init_TypeDef values, provides reasonable Tx/Rx FIFO
 *  partitioning.                                                         */
/* In DMA mode the total available FIFO space is smaller.       */
/* The DMA controller use one FIFO word pr. channel for status. */
/* The unit in the table is byte.                               */
#define USBH_INIT_DEFAULT                                                    \
{                                                                            \
  MAX_HOST_FIFO_SIZE_INWORDS * 2,/* 1024 bytes Rx FIFO size.             */  \
  MAX_HOST_FIFO_SIZE_INWORDS,    /* 512 bytes non-periodic Tx FIFO size. */  \
  MAX_HOST_FIFO_SIZE_INWORDS,    /* 512 bytes periodic Tx FIFO size.     */  \
  0                              /* Reserved.                            */  \
}

/*** -------------------- HOST mode API ---------------------------------- ***/

int     USBH_AssignHostChannel(            USBH_Ep_TypeDef *ep, uint8_t hcnum);
int     USBH_ControlMsg(                   USBH_Ep_TypeDef *ep, uint8_t bmRequestType, uint8_t bRequest, uint16_t wValue, uint16_t wIndex, uint16_t wLength, void *data, int timeout, USB_XferCompleteCb_TypeDef callback);
int     USBH_ControlMsgB(                  USBH_Ep_TypeDef *ep, uint8_t bmRequestType, uint8_t bRequest, uint16_t wValue, uint16_t wIndex, uint16_t wLength, void *data, int timeout);
bool    USBH_DeviceConnected(              void);
int     USBH_GetConfigurationDescriptorB(  USBH_Device_TypeDef *device, void *buf, int len, uint8_t configIndex);
int     USBH_GetDeviceDescriptorB(         USBH_Device_TypeDef *device, void *buf, int len);
uint8_t USBH_GetPortSpeed(                 void);
int     USBH_GetStringB(                   USBH_Device_TypeDef *device, uint8_t *buf, int bufLen, uint8_t stringIndex, uint16_t langID);
int     USBH_Init(                         const USBH_Init_TypeDef *p);
int     USBH_InitDeviceData(               USBH_Device_TypeDef *device, const uint8_t *buf, USBH_Ep_TypeDef *ep, int numEp, uint8_t deviceSpeed);
int     USBH_PortReset(                    void);
int     USBH_PortResume(                   void);
void    USBH_PortSuspend(                  void);
void    USBH_PrintString(                  const char *pre, const USB_StringDescriptor_TypeDef *s, const char *post);

#if defined(USB_USE_PRINTF)
int     USBH_PrintConfigurationDescriptor( const USB_ConfigurationDescriptor_TypeDef *config, int maxLen);
int     USBH_PrintDeviceDescriptor(        const USB_DeviceDescriptor_TypeDef *device);
int     USBH_PrintEndpointDescriptor(      const USB_EndpointDescriptor_TypeDef *endpoint);
int     USBH_PrintInterfaceDescriptor(     const USB_InterfaceDescriptor_TypeDef *interface);
#else
#define USBH_PrintConfigurationDescriptor( config, maxLen)
#define USBH_PrintDeviceDescriptor(        device)
#define USBH_PrintEndpointDescriptor(      endpoint)
#define USBH_PrintInterfaceDescriptor(     interface)
#endif /* defined(USB_USE_PRINTF) */

int                                  USBH_QueryDeviceB(                uint8_t *buf, size_t bufsize, uint8_t deviceSpeed);
USB_ConfigurationDescriptor_TypeDef* USBH_QGetConfigurationDescriptor( const uint8_t *buf, int configIndex);
USB_DeviceDescriptor_TypeDef*        USBH_QGetDeviceDescriptor(        const uint8_t *buf);
USB_EndpointDescriptor_TypeDef*      USBH_QGetEndpointDescriptor(      const uint8_t *buf, int configIndex, int interfaceIndex, int endpointIndex);
USB_InterfaceDescriptor_TypeDef*     USBH_QGetInterfaceDescriptor(     const uint8_t *buf, int configIndex, int interfaceIndex);

int     USBH_Read(                         USBH_Ep_TypeDef *ep, void *data, int byteCount, int timeout, USB_XferCompleteCb_TypeDef callback);
int     USBH_ReadB(                        USBH_Ep_TypeDef *ep, void *data, int byteCount, int timeout);
int     USBH_SetAddressB(                  USBH_Device_TypeDef *device, uint8_t deviceAddress);
int     USBH_SetAltInterfaceB(             USBH_Device_TypeDef *device, uint8_t interfaceIndex, uint8_t alternateSetting);
int     USBH_SetConfigurationB(            USBH_Device_TypeDef *device, uint8_t configValue);
int     USBH_StallEpB(                     USBH_Ep_TypeDef *ep);
void    USBH_Stop(                         void);
int     USBH_UnStallEpB(                   USBH_Ep_TypeDef *ep);
int     USBH_WaitForDeviceConnectionB(     uint8_t *buf, int timeoutInSeconds);
int     USBH_Write(                        USBH_Ep_TypeDef *ep, void *data, int byteCount, int timeout, USB_XferCompleteCb_TypeDef callback);
int     USBH_WriteB(                       USBH_Ep_TypeDef *ep, void *data, int byteCount, int timeout);

/** @} (end addtogroup USB_HOST) */
#endif /* defined(USB_HOST) */
/** @} (end addtogroup USB) */

#ifdef __cplusplus
}
#endif

#endif /* defined(USB_DEVICE) || defined(USB_HOST) */
#endif /* defined(USB_PRESENT) && (USB_COUNT == 1) */
#endif /* __EM_USB_H */
